# ####################################################################

#  Created by Encounter(R) RTL Compiler RC13.12 - v13.10-s021_1 on Sun Feb 23 00:23:27 +0100 2020

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design MIPS_32_1P_MUL_DIV

create_clock -name "clk_392MHz" -add -period 2.55 -waveform {0.0 1.275} [get_ports CK]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports RESET_N]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {IT_N[5]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {IT_N[4]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {IT_N[3]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {IT_N[2]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {IT_N[1]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {IT_N[0]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[9]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[8]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[7]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[6]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[5]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[4]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[3]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[2]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[1]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {CPU_NBR[0]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports I_RBERR]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports I_ACCPT]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[31]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[30]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[29]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[28]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[27]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[26]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[25]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[24]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[23]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[22]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[21]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[20]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[19]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[18]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[17]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[16]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[15]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[14]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[13]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[12]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[11]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[10]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[9]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[8]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[7]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[6]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[5]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[4]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[3]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[2]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[1]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_IN[0]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_RBERR]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_WBERR]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_ACCPT]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[31]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[30]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[29]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[28]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[27]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[26]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[25]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[24]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[23]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[22]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[21]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[20]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[19]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[18]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[17]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[16]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[15]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[14]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[13]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[12]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[11]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[10]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[9]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[8]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[7]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[6]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[5]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[4]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[3]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[2]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[1]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_IN[0]}]
set_input_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports MCHECK_N]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[31]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[30]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[29]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[28]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[27]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[26]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[25]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[24]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[23]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[22]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[21]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[20]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[19]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[18]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[17]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[16]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[15]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[14]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[13]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[12]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[11]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[10]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[9]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[8]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[7]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[6]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[5]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[4]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[3]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {I_A[2]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports I_RQ]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {MODE[1]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {MODE[0]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports I_ACK]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports I_BEREN]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports I_INLINE]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[31]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[30]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[29]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[28]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[27]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[26]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[25]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[24]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[23]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[22]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[21]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[20]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[19]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[18]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[17]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[16]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[15]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[14]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[13]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[12]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[11]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[10]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[9]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[8]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[7]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[6]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[5]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[4]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[3]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_A[2]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_BYTSEL[3]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_BYTSEL[2]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_BYTSEL[1]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_BYTSEL[0]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_RQ]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_RW]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_SYNC]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_REG]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_LINKED]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_RSTLKD]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_CACHE]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_CACHOP[4]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_CACHOP[3]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_CACHOP[2]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_CACHOP[1]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_CACHOP[0]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[31]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[30]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[29]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[28]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[27]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[26]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[25]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[24]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[23]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[22]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[21]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[20]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[19]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[18]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[17]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[16]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[15]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[14]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[13]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[12]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[11]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[10]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[9]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[8]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[7]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[6]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[5]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[4]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[3]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[2]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[1]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports {D_OUT[0]}]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports D_ACK]
set_output_delay -clock [get_clocks clk_392MHz] -add_delay 0.0544 [get_ports SCOUT]
set_wire_load_mode "enclosed"
set_wire_load_selection_group "default_by_area" -library "CORE9GPHS"
set_dont_use [get_lib_cells CORE9GPHS/BK1HSX05]
set_dont_use [get_lib_cells CORE9GPHS/BK1SHSX05]
set_dont_use [get_lib_cells CORE9GPHS/BTSHS]
set_dont_use [get_lib_cells CORE9GPHS/FD9QHS]
set_dont_use [get_lib_cells CORE9GPHS/FD9QHSP]
set_dont_use [get_lib_cells CORE9GPHS/FD9QHSX4]
set_dont_use [get_lib_cells CORE9GPHS/FD9SQHS]
set_dont_use [get_lib_cells CORE9GPHS/FD9SQHSP]
set_dont_use [get_lib_cells CORE9GPHS/FD9SQHSX4]
set_dont_use [get_lib_cells CORE9GPHS/ITSHS]
set_dont_use [get_lib_cells CORE9GPHS/LD1TQHS]
set_dont_use [get_lib_cells CORE9GPHS/LD7QHS]
set_dont_use [get_lib_cells CORE9GPHS/LD7QHSP]
set_dont_use [get_lib_cells CORE9GPHS/LD7QHSX4]
set_dont_use [get_lib_cells CORE9GPHS/LD7QHSX6]
set_dont_use [get_lib_cells CORE9GPHS/LD7QHSX8]
set_dont_use [get_lib_cells CORE9GPHS/LD8QHS]
set_dont_use [get_lib_cells CORE9GPHS/LD8QHSP]
set_dont_use [get_lib_cells CORE9GPHS/LD8QHSX4]
set_dont_use [get_lib_cells CORE9GPHS/LD8QHSX6]
set_dont_use [get_lib_cells CORE9GPHS/LD8QHSX8]

set_propagated_clock [all_clocks]
